<template>
  <app-block>
    <h1 slot="title" class="pa-3">Важная Информация</h1>
    <v-carousel slot="content" show-arrows-on-hover>
      <v-carousel-item v-for="(item, index) in items" :key="index">
        <app-text-card :item="item" :isCarousel="true"></app-text-card>
      </v-carousel-item>
    </v-carousel>
  </app-block>
</template>

<script>
import Block from '../blocks/Block'
import TextCard from './TextCard'
export default {
  name: 'ImportantInfo',
  components: {
    appBlock: Block,
    appTextCard: TextCard
  },
  data () {
    return {
      items: [
        {
          title: '',
          date: '29.04.2020',
          text: 'Обращаем внимание на то, что ГУП "Белводоканал" не оказывает услуги по продаже и установке фильтров для очистки воды.'
        },
        {
          title: 'Info 2. Title',
          date: '30.04.2020',
          text: 'Обращаем внимание на то, что ГУП "Белводоканал" не оказывает услуги по продаже и установке фильтров для очистки воды.'
        },
        {
          title: 'Info 3. Title',
          date: '01.05.2020',
          text: 'Обращаем внимание на то, что ГУП "Белводоканал" не оказывает услуги по продаже и установке фильтров для очистки воды. ' +
            'Обращаем внимание на то, что ГУП "Белводоканал" не оказывает услуги по продаже и установке фильтров для очистки воды.' +
            'Обращаем внимание на то, что ГУП "Белводоканал" не оказывает услуги по продаже и установке фильтров для очистки воды.' +
            'Обращаем внимание на то, что ГУП "Белводоканал" не оказывает услуги по продаже и установке фильтров для очистки воды.' +
            'Обращаем внимание на то, что ГУП "Белводоканал" не оказывает услуги по продаже и установке фильтров для очистки воды.' +
            'Обращаем внимание на то, что ГУП "Белводоканал" не оказывает услуги по продаже и установке фильтров для очистки воды.' +
            'Обращаем внимание на то, что ГУП "Белводоканал" не оказывает услуги по продаже и установке фильтров для очистки воды.' +
            'Обращаем внимание на то, что ГУП "Белводоканал" не оказывает услуги по продаже и установке фильтров для очистки воды.' +
            'Обращаем внимание на то, что ГУП "Белводоканал" не оказывает услуги по продаже и установке фильтров для очистки воды.' +
            'Обращаем внимание на то, что ГУП "Белводоканал" не оказывает услуги по продаже и установке фильтров для очистки воды.'
        },
        {
          title: 'Info 4. Title',
          date: '02.05.2020',
          text: 'Обращаем внимание на то, что ГУП "Белводоканал" не оказывает услуги по продаже и установке фильтров для очистки воды. ' +
            'Обращаем внимание на то, что ГУП "Белводоканал" не оказывает услуги по продаже и установке фильтров для очистки воды.'
        },
        {
          title: 'Info 5. Title',
          date: '03.05.2020',
          text: 'Info 5. Text'
        },
        {
          title: 'Info 6. Title',
          date: '04.05.2020',
          text: 'Info 6. Text'
        },
        {
          title: 'Info 7. Title',
          date: '05.05.2020',
          text: 'Info 7. Text'
        }
      ]
    }
  }
}
</script>

<style scoped>

</style>
